Revit 2024 API
ViewSheetSetting Methods
The ViewSheetSetting type exposes the following members.
Methods
Name | Description
Delete
Delete the current view sheet set, and make the In-Session set as the current one.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Rename
Rename the current view sheet set.
Revert
Revert the current view sheet set.
Save
Save the changes for the current view sheet set.
SaveAs
Save the current view sheet set to another view sheet set with the specified name.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace